КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_ГорючеСмазочныеМатериалы/КонтурЛогистика_ГорючеСмазочныеМатериалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_ГорючеСмазочныеМатериалы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИмяПредопределенногоДляРасширения</name>
    <comment>В расширениях запрещено использовать предопределенные. Будем использовать это поле.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипТоплива</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыТоплива</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидТоплива</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ВидыТоплива</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидТопливаПрочее</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияПоКлассификатору</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ЕдиницыИзмеренияГСМ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СвязанныеОбъекты</name>
    <attributes>
      <name>СвязанныйОбъект</name>
      <type>
        <types>DefinedType.КонтурЛогистика_Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>УИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначенияУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ТипыТоплива/КонтурЛогистика_ТипыТоплива.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипыТоплива</name>
  <enumValues>
    <name>Biodiesel</name>
  </enumValues>
  <enumValues>
    <name>CompressedNaturalGas</name>
  </enumValues>
  <enumValues>
    <name>Diesel</name>
  </enumValues>
  <enumValues>
    <name>Electricity</name>
  </enumValues>
  <enumValues>
    <name>Gasoline</name>
  </enumValues>
  <enumValues>
    <name>LiquefiedPetroleumGas</name>
  </enumValues>
  <enumValues>
    <name>Other</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ВидыТоплива/КонтурЛогистика_ВидыТоплива.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ВидыТоплива</name>
  <enumValues>
    <name>AI80</name>
  </enumValues>
  <enumValues>
    <name>AI92</name>
  </enumValues>
  <enumValues>
    <name>AI95</name>
  </enumValues>
  <enumValues>
    <name>AI98</name>
  </enumValues>
  <enumValues>
    <name>ArcticDiesel</name>
  </enumValues>
  <enumValues>
    <name>Methane</name>
  </enumValues>
  <enumValues>
    <name>MidSeason</name>
  </enumValues>
  <enumValues>
    <name>Other</name>
  </enumValues>
  <enumValues>
    <name>Propane</name>
  </enumValues>
  <enumValues>
    <name>Winter</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ЕдиницыИзмеренияГСМ/КонтурЛогистика_ЕдиницыИзмеренияГСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ЕдиницыИзмеренияГСМ</name>
  <enumValues>
    <name>л</name>
  </enumValues>
  <enumValues>
    <name>лСНГ</name>
  </enumValues>
  <enumValues>
    <name>КубМСПГ</name>
  </enumValues>
  <enumValues>
    <name>кВтЧ</name>
  </enumValues>
  <enumValues>
    <name>Иное</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_ГорючеСмазочныеМатериалы/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// +++ КонтурЛогистика_НастройкиКонвертацииСправочников
	КонтурЛогистика_КонвертацияСервер.НастройкиКонвертацииСправочников_ПриСозданииНаСервере(
		ЭтаФорма, "КонтурЛогистика_ГорючеСмазочныеМатериалы", ЭтаФорма, Элементы.ГруппаНаименованиеКод);
	// --- КонтурЛогистика_НастройкиКонвертацииСправочников
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьСписокВыбораВидаТоплива();
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("ОповещениеЗавершения");
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ВыбратьЭлементУчетнойСистемыЗавершение(ВыбранноеЗначение, ДополнительныеПараметры);
	
	УстановитьВидимостьЭлементов();
	
	УправлениеВидимостьюЭлементовФормыСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// +++ КонтурЛогистика_НастройкиКонвертацииСправочников
	КонтурЛогистика_КонвертацияКлиент.ОбработкаОповещения(ЭтаФорма, ИмяСобытия, Параметр, Источник);
	// --- КонтурЛогистика_НастройкиКонвертацииСправочников
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипТопливаПриИзменении(Элемент)
	
	Если Объект.ТипТоплива = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыТоплива.Other") Тогда
		Объект.ВидТоплива = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ВидыТоплива.Other");
	КонецЕсли;
	
	ЗаполнитьСписокВыбораВидаТоплива();
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидТопливаПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияКлассификаторПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСвязанныеОбъекты

&НаКлиенте
Процедура СвязанныеОбъектыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	УстановитьВидимостьЭлементов();
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеОбъектыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОбработкаВыбораСвязанногоОбъекта(ЭтаФорма, ВыбранноеЗначение);
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеОбъектыПослеУдаления(Элемент)
	
	УстановитьВидимостьЭлементов();
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеОбъектыСвязанныйОбъектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ПоказатьСписокТиповДляСвязанногоОбъекта(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеОбъектыСвязанныйОбъектОткрытие(Элемент, СтандартнаяОбработка)
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОткрытьСвязанныйОбъект(ЭтаФорма, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	
	Элементы.ГруппаВидТоплива.Видимость = Ложь;
	
	Если Объект.ТипТоплива = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыТоплива.CompressedNaturalGas")
		Или Объект.ТипТоплива = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыТоплива.Diesel")
		Или Объект.ТипТоплива = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыТоплива.Gasoline") Тогда
		
		Элементы.ГруппаВидТоплива.Видимость = Истина;
	КонецЕсли;
	
	Элементы.ВидТопливаПрочее.Видимость = (Объект.ВидТоплива = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ВидыТоплива.Other"));
	Элементы.ЕдиницаИзмерения.Видимость = 
		(Объект.ЕдиницаИзмеренияПоКлассификатору = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ЕдиницыИзмеренияГСМ.Иное"));
	
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_СинхронизироватьОбъектЛогистикиСОбъектомУС.Видимость = (Объект.СвязанныеОбъекты.Количество() = 1);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораВидаТоплива()
	
	СписокВыбораВидаТоплива = Новый Массив;
	
	Если Объект.ТипТоплива = Перечисления.КонтурЛогистика_ТипыТоплива.CompressedNaturalGas Тогда
		
		СписокВыбораВидаТоплива.Добавить(Перечисления.КонтурЛогистика_ВидыТоплива.Propane);
		СписокВыбораВидаТоплива.Добавить(Перечисления.КонтурЛогистика_ВидыТоплива.Methane);
		СписокВыбораВидаТоплива.Добавить(Перечисления.КонтурЛогистика_ВидыТоплива.Other);
		
	ИначеЕсли Объект.ТипТоплива = Перечисления.КонтурЛогистика_ТипыТоплива.Diesel Тогда
		
		СписокВыбораВидаТоплива.Добавить(Перечисления.КонтурЛогистика_ВидыТоплива.MidSeason);
		СписокВыбораВидаТоплива.Добавить(Перечисления.КонтурЛогистика_ВидыТоплива.Winter);
		СписокВыбораВидаТоплива.Добавить(Перечисления.КонтурЛогистика_ВидыТоплива.ArcticDiesel);
		СписокВыбораВидаТоплива.Добавить(Перечисления.КонтурЛогистика_ВидыТоплива.Other);
		
	ИначеЕсли Объект.ТипТоплива = Перечисления.КонтурЛогистика_ТипыТоплива.Gasoline Тогда
		
		СписокВыбораВидаТоплива.Добавить(Перечисления.КонтурЛогистика_ВидыТоплива.AI80);
		СписокВыбораВидаТоплива.Добавить(Перечисления.КонтурЛогистика_ВидыТоплива.AI92);
		СписокВыбораВидаТоплива.Добавить(Перечисления.КонтурЛогистика_ВидыТоплива.AI95);
		СписокВыбораВидаТоплива.Добавить(Перечисления.КонтурЛогистика_ВидыТоплива.AI98);
		СписокВыбораВидаТоплива.Добавить(Перечисления.КонтурЛогистика_ВидыТоплива.Other);
		
	КонецЕсли;
	
	Элементы.ВидТоплива.СписокВыбора.ЗагрузитьЗначения(СписокВыбораВидаТоплива);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюЭлементовФормыСервер()
	
	КонтурЛогистика_КонвертацияСервер.УправлениеВидимостьюЭлементовФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНастройкуКонвертации(Элемент) Экспорт
	
	КонтурЛогистика_КонвертацияКлиент.СоздатьНастройкуКонвертации(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКНастройкеКонвертацииСправочника(Элемент) Экспорт 
	
	КонтурЛогистика_КонвертацияКлиент.ПерейтиКНастройкеКонвертацииСправочника(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти
